//===================================================
//
// リザルトヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _RESULT_H_
#define _RESULT_H_	

//-------------------------------
// インクルード
//--------------------------------
#include <d3dx9.h>

//================================
// 前方宣言
//================================
class CObject2D;

//================================
// リザルトクラスの定義
//================================
class CResult
{
public:
	CResult();	//コンストラクタ
	~CResult();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

	//------------------
	// メンバ変数
	//------------------
	CObject2D*m_pObject2D;
};

#endif