//===================================================
//
// タイトルヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _TITLE_H_
#define _TITLE_H_	

//--------------------------------
// インクルード
//--------------------------------
#include <d3dx9.h>

//================================
// 前方宣言
//================================
class CObject2D;

//================================
// タイトルクラスの定義
//================================
class CTitle
{
public:
	CTitle();	//コンストラクタ
	~CTitle();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

	//------------------
	// メンバ変数
	//------------------
	CObject2D*m_pObject2D;
};

#endif