//===================================================
//
// チュートリアルヘッダー
// Author : Sato Teruto
//
//===================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_	

//-------------------------------
// インクルード
//--------------------------------
#include <d3dx9.h>

//================================
// 前方宣言
//================================
class CObject2D;

//================================
// チュートリアルクラスの定義
//================================
class CTutorial
{
public:
	CTutorial();	//コンストラクタ
	~CTutorial();	//デストラクタ

//------------------
// メンバ関数
//------------------
	HRESULT Init();
	void Uninit();
	void Update();



//------------------
// メンバ変数
//------------------
	CObject2D* m_pObject2D;

};

#endif